[VersionInfo]
ver=1.3.4

[WMXFailMessage]
kr=WMX Engine 에러
us=WMX Engine Error

[RTXSubsystemException]
kr=RTX 서브시스템이 예외 상태입니다. RTX를 다시 시작해주세요.
us=RTX subsystem is Exception State. Please Restart RTX subsystem.


//Global
[Open]
kr=열기
us=Open

[Close]
kr=종료
us=Close


[X_Axis]
kr=X 축
us=X Axis

[Y_Axis]
kr=Y 축
us=Y Axis

[Z_Axis]
kr=Z 축
us=Z Axis

[A_Axis]
kr=A 축
us=A Axis

[T_Axis]
kr=T 축
us=T Axis

//Button
[Btn_LogIn]
kr=로그인
us=Login

[Btn_Logout]
kr=로그아웃
us=Logout

[Btn_Extend]
kr=연장
us=Extend

[Btn_LanguageSetting]
kr=언어 설정
us=Language Setting

[Btn_EquipSettings]
kr=설비 설정
us=Equip Settings

[Btn_MotionSettings]
kr=모션 설정
us=Motion Settings

[Btn_MasterIO]
kr=마스터 I/O
us=Master I/O

[Btn_MasterCtrlForm]
kr=마스터 제어
us=Master Control

[Btn_RMTPForm]
kr=랙마스터 제어
us=RackMaster Control

[Btn_PortTPForm]
kr=포트 제어
us=Port Control

[Btn_BuzzerStop]
kr=부저 스탑
us=Buzzer Stop

[Btn_BuzzerOn]
kr=부저 온
us=Buzzer On

[Btn_MasterAlarmClear]
kr=마스터 알람 초기화
us=Master Alarm Clear

[Btn_AllAlarmClear]
kr=전체 알람 초기화
us=All Alarm Clear

[Btn_AllEquipPowerOn]
kr=모든 설비 파워 온
us=All Equip Power On

[Btn_AllEquipPowerOff]
kr=모든 설비 파워 오프
us=All Equip Power Off

[Btn_AllEquipCIMMode]
kr=모든 설비 CIM Mode
us=All Equip CIM Mode

[Btn_AllEquipMasterMode]
kr=모든 설비 Master Mode
us=All Equip Master Mode

[Btn_AllEquipAutoRun]
kr=모든 설비 자동 시작
us=All Equip Auto Run

[Btn_AllEquipAutoStop]
kr=모든 설비 자동 정지
us=All Equip Auto Stop

[Btn_Apply]
kr=적용
us=Apply

[Btn_Cancel]
kr=취소
us=Cancel

[Btn_Close]
kr=닫기
us=Close

[Btn_Add]
kr=추가
us=Add

[Btn_Delete]
kr=삭제
us=Delete

[Btn_AutoRun]
kr=자동 공정 시작
us=Auto Run

[Btn_AutoStop]
kr=자동 공정 정지
us=Auto Stop

[Btn_CIMMode]
kr=CIM 제어 모드
us=CIM Mode

[Btn_MasterMode]
kr=Master 제어 모드
us=Master Mode

[Btn_PowerOn]
kr=파워 온
us=Power On

[Btn_PowerOff]
kr=파워 오프
us=Power Off

[Btn_AlarmClear]
kr=알람 초기화
us=Alarm Clear

[Btn_PortEStop]
kr=포트 비상 정지
us=Port E-Stop

[Btn_RMEStop]
kr=랙 마스터 긴급 정지
us=RM E-Stop

[Btn_EStopRelease]
kr=긴급 정지 해제
us=E-Stop Release

[Btn_LanguagePackReload]
kr=언어 팩 다시 로드
us=Language Pack Reload

[Btn_Main]
kr=메인
us=Main

[Btn_Teaching]
kr=티칭
us=Teaching

[Btn_Settings]
kr=설정
us=Settings

[Btn_IO]
kr=I/O
us=I/O

[Btn_Motor]
kr=모터
us=Motor

[Btn_MappingInfo]
kr=맵핑 정보
us=Mapping Info

[Btn_CSTInfo]
kr=카세트 정보
us=Cassette Info

[Btn_CPSInfo]
kr=CPS 정보
us=CPS Info

[Btn_Log]
kr=로그
us=Log

[Btn_AlarmInfo]
kr=알람 정보
us=Alarm Info

[Btn_CycleRun]
kr=사이클 시작
us=Cycle Run

[Btn_CycleStop]
kr=사이클 정지
us=Cycle Stop

[Btn_Send]
kr=전송
us=Send

[Btn_AllSend]
kr=전체 전송
us=All Send

[Btn_Clear]
kr=초기화
us=Clear

[Btn_AllClear]
kr=전체 초기화
us=All Clear

[Btn_TimeSync]
kr=시간 동기화
us=Time Sync

[Btn_NewFile]
kr=새 파일
us=New File

[Btn_FileLoad]
kr=파일 불러오기
us=File Load

[Btn_FileSave]
kr=파일 저장
us=File Save

[Btn_FileSaveAs]
kr=다른 이름으로 저장
us=File Save as

[Btn_RowUp]
kr=행 이동(위)
us=Row Move Up

[Btn_RowDown]
kr=행 이동(아래)
us=Row Move Down

[Btn_RowAdd]
kr=행 추가
us=Row Add

[Btn_RowInsert]
kr=행 삽입
us=Row Insert

[Btn_RowRemove]
kr=선택 행 삭제
us=Selected Row Remove

[Btn_SingleTeachingMode]
kr=단일 티칭 모드
us=Single Teaching Mode

[Btn_ContinuousTeachingMode]
kr=연속 티칭 모드
us=Continuous Teaching Mode

[Btn_TeachingStart]
kr=티칭 시작
us=Teaching Start

[Btn_TeachingStop]
kr=티칭 정지
us=Teaching Stop

[Btn_LoadSelectedCellInfo]
kr=선택 행 Shelf 정보 불러오기
us=Retrieve Selected Row Shelf Information

[Btn_NRangeShelfAllCheck]
kr=영역 Shelf 체크
us=Range Shelf Check

[Btn_ShelfAllCheck]
kr=모든 Shelf 체크
us=All Shelf Check

[Btn_NRangeFailShelfAllCheck]
kr=영역 실패 Shelf 체크
us=Range Fail Shelf Check

[Btn_ShelfFailAllCheck]
kr=모든 실패 Shelf 체크
us=All Fail Shelf Check

[Btn_NRangeShelfUncheck]
kr=영역 Shelf 체크 해제
us=Range Shelf Uncheck

[Btn_ShelfAllUncheck]
kr=모든 Shelf 체크 해제
us=All Shelf Uncheck

[Btn_ModeChange]
kr=운용 모드 변경
us=Operation Mode Change

[Btn_DirectionChange]
kr=공정 방향 변경
us=Operation Direction Change

[Btn_DoorOpen]
kr=문 열림
us=Door Open

[Btn_DoorClose]
kr=문 닫힘
us=Door Close

[Btn_ParamSave]
kr=파라미터 저장
us=Save Param

[Btn_ServoOn]
kr=서보 온
us=Servo On

[Btn_ServoOff]
kr=서보 오프
us=Servo off

[Btn_Homing]
kr=원점 검색
us=Origin Search

[Btn_HomeDone]
kr=원점 완료
us=Origin Done

[Btn_AmpAlarmClear]
kr=앰프 알람 초기화
us=Amp Alarm Clear

[Btn_MotionStop]
kr=동작 정지
us=Motion Stop

[Btn_CylinderStop]
kr=실린더 정지
us=Cylinder Stop

[Btn_InverterStop]
kr=인버터 정지
us=Inverter Stop

[Btn_InverterReset]
kr=인버터 리셋
us=Inverter Reset

[Btn_StopperStop]
kr=스토퍼 정지
us=Stopper Stop

[Btn_CenteringStop]
kr=센터링 정지
us=Centering Stop

[Btn_ConveyorStop]
kr=컨베이어 정지
us=Conveyor Stop

[Btn_CVReset]
kr=컨베이어 리셋
us=Conveyor Reset

[Btn_Refresh]
kr=새로 고침
us=Refresh

[Btn_SavetoPort]
kr=포트에 저장
us=Save to Port

[Btn_SavetoAllPort]
kr=모든 포트에 저장
us=Save to All Port

[Btn_Buffer]
kr=버퍼
us=Buffer

[Btn_PortAllCheck]
kr=모든 포트 체크
us=Port All Check

[Btn_PortAllUncheck]
kr=모든 포트 체크 해제
us=Port All Uncheck

[Btn_GetBaseShelfData]
kr=기준 쉘프 정보 얻기
us=Get Base Shelf Info

[Btn_CreateAutoTeachingTable]
kr=테이블 생성
us=Create Table

[Btn_OffsetApply]
kr=오프셋 적용
us=Offset Apply


//GroupBox
[GorupBox_MasterStatus]
kr=마스터 상태
us=Master Status

[GorupBox_MasterEquipment]
kr=마스터 설비 항목
us=Master Equipments

[GorupBox_MasterEquipmentStatus]
kr=마스터 설비 상태
us=Master Equipments Status

[GroupBox_SafetyIOStatus]
kr=안전 입출력 상태
us=Safty I/O Status

[GroupBox_SafetyIOMap]
kr=안전 입출력 맵
us=Safty I/O Map

[GorupBox_EquipmentControls]
kr=설비 제어
us=Equipment Controls

[GorupBox_BasicInfo]
kr=요약 정보
us=Basic Info

[GorupBox_ErrorInfo]
kr=에러 정보
us=Error Info

[GorupBox_ErrorDetailInfo]
kr=에러 상세 정보
us=Error Detail Info

[GorupBox_StatusInfo]
kr=상태 정보
us=Status Info

[GorupBox_Interlock]
kr=인터락 정보
us=Interlock Info

[GorupBox_CIMSettings]
kr=CIM 설정
us=CIM Settings

[GorupBox_CPSSettings]
kr=CPS 설정
us=CPS Settings

[GorupBox_RackMasterSettings]
kr=랙마스터 설정
us=RackMaster Settings

[GorupBox_PortSettings]
kr=포트 설정
us=Port Settings

[GorupBox_RackMasterStatus]
kr=랙마스터 상태
us=RackMaster Status

[GorupBox_MotionStatus]
kr=모션 상태
us=Motion Status

[GorupBox_SensorStatus]
kr=센서 상태
us=Sensor Status

[GroupBox_RegulatorStatus]
kr=레귤레이터 상태
us=Regulator Status

[GorupBox_PIOStatus]
kr=PIO 상태
us=PIO Status

[GorupBox_AutoCycleTest]
kr=자동 공정 사이클 테스트
us=Auto Run Cycle Test

[GroupBox_AutoRunStatus]
kr=자동 공정 상태
us=Auto Run Status

[GorupBox_PortInfo]
kr=포트 정보
us=Port Info

[GorupBox_RMInfo]
kr=랙 마스터 정보
us=RackMaster Info

[GorupBox_PortStatus]
kr=포트 상태
us=Port Status

[GorupBox_ShuttleMotionStatus]
kr=셔틀 모션 상태
us=Shuttle Motion Status

[GorupBox_ShuttleAxisSensorStatus]
kr=셔틀 축 센서 상태
us=Shuttle Axis Sensor Status

[GorupBox_BufferSensorStatus]
kr=버퍼 센서 상태
us=Buffer Sensor Status

[GorupBox_Shuttle_SideStatus]
kr=셔틀 영역 상태
us=Shuttle Side Status

[GorupBox_AccessPortInfo]
kr=접근 포트 정보
us=Access Port Info

[GorupBox_SelectedPortInfo]
kr=선택 포트 정보
us=Selected Port Info

[GorupBox_RackMasterSpeedSetting]
kr=랙마스터 속도 설정
us=RackMaster Speed Settings

[GorupBox_RackMasterSubCommand]
kr=랙마스터 부가 명령
us=RackMaster Sub Commands

[GorupBox_RackMaster_OverloadSetting]
kr=랙마스터 과부하 설정
us=RackMaster Overload Settings

[GorupBox_RackMaster_OverloadClear]
kr=랙마스터 과부하 초기화
us=RackMaster Overload Clears

[GorupBox_TeachingFileInfo]
kr=티칭 파일 정보
us=Teaching File Info

[GorupBox_TeachingStatus]
kr=자동 티칭 상태
us=Auto Teaching Status

[GorupBox_SingleTeachingParam]
kr=단일 티칭 파라미터
us=Single Teaching Parameter

[GorupBox_ContinuousTeachingParam]
kr=연속 티칭 파라미터
us=Continuous Teaching Parameter

[GorupBox_ControlAxisSelection]
kr=제어 요소 선택
us=Control element selection

[GorupBox_MotionCommand]
kr=모션 제어 명령
us=Motion Control Command

[GroupBox_Servo]
kr=서보
us=Servo

[GroupBox_Jog]
kr=조그
us=Jog

[GroupBox_Rel]
kr=상대 위치
us=Relative

[GroupBox_Abs]
kr=절대 위치
us=Absolute

[GroupBox_RelandAbs]
kr=상대, 절대 위치
us=Relative and Absolute

[GorupBox_PortControl]
kr=포트 제어
us=Port Controls

[GorupBox_RFID]
kr=RFID
us=RFID

[GorupBox_RackMasterManualPIO]
kr=랙마스터 수동 PIO
us=RackMaster Manual PIO

[GorupBox_TeachingPosMove]
kr=포트 티칭 위치 이동
us=Port Teaching Pos Move

[GorupBox_ManualMoveSpeedSetting]
kr=포트 매뉴얼 동작 속도 설정
us=Port Manual Move Speed Settings

[GroupBox_AutoRunMoveSpeed]
kr=포트 자동 공정 동작 속도 설정
us=Port Auto Move Speed Settings

[GroupBox_TeachingParameter]
kr=티칭 매개변수
us=Teaching Parameters

[GroupBox_WMXServoParameterSettings]
kr=WMX 서보 파라미터 설정
us=WMX Servo Parameter Settings

[GroupBox_WMXIOParameterSettings]
kr=WMX IO 파라미터 설정
us=WMX IO Parameter Settings

[GroupBox_PortErrorTimeSettings]
kr=포트 에러 시간 설정
us=Port Error Time Settings

[GorupBox_Port_OverloadSetting]
kr=포트 과부하 설정
us=Port Overload Settings

[GorupBox_Port_OverloadClear]
kr=포트 과부하 초기화
us=Port Overload Clears

[GroupBox_ServoCommand]
kr=서보 제어 명령
us=Servo Control Command

[GorupBox_CylinderCommand]
kr=실린더 제어 명령
us=Cylinder Control Command

[GorupBox_InverterCommand]
kr=인버터 제어 명령
us=Inverter Control Command

[GorupBox_ConveyorCommand]
kr=컨베이어 제어 명령
us=Conveyor Control Command

[GorupBox_Stopper]
kr=스토퍼
us=Stopper

[GorupBox_Centering]
kr=센터링
us=Centering

[GorupBox_Move]
kr=동작
us=Move

[GorupBox_Flag]
kr=플래그
us=Flag

[GorupBox_SyncMove]
kr=동기 동작
us=Sync Move

[GorupBox_PortControlParameterSettings]
kr=포트 제어 파라미터 설정
us=Port Control Parameter Settings

[GorupBox_ConveyorControlParameterSettings]
kr=컨베이어 제어 파라미터 설정
us=Conveyor Control Parameter Settings

[GorupBox_MemoryMapInfo]
kr=메모리 맵 정보
us=Memory Map Info

[GorupBox_CSTInfo]
kr=카세트 정보
us=Cassette Info

[GorupBox_CPSInfo]
kr=CPS 정보
us=CPS Info


[GroupBox_MasterInterlockControl]
kr=마스터 인터락 제어
us=Master Interlock Control

[GroupBox_Filter_PortID]
kr=필터(포트 ID)
us=Filter(Port ID)

[GroupBox_Filter_Level]
kr=필터(알람 레벨)
us=Filter(Alarm Level)

[GroupBox_Filter_Days]
kr=필터(날짜)
us=Filter(Days)

[GroupBox_LogHistory]
kr=로그 이력
us=Log History

[GroupBox_Function]
kr=기능
us=Function

[GroupBox_BufferSensorStatus]
kr=버퍼 센서 상태
us=Buffer Sensor Status

[GroupBox_TwoBufferSensorMap]
kr=Two Buffer 센서 맵
us=Two Buffer Sensor Map

[GroupBox_OneBufferSensorMap]
kr=One 버퍼 센서 맵
us=One Buffer Sensor Map

[GroupBox_CVBufferSensorMap]
kr=컨베이어 버퍼 센서 맵
us=Conveyor Buffer Sensor Map

[GroupBox_ShuttleXSensorMap]
kr=셔틀 X축 센서 맵
us=Shuttle X Axis Sensor Map

[GroupBox_ShuttleXSensorStatus]
kr=셔틀 X축 센서 상태
us=Shuttle X Axis Sensor Status

[GroupBox_ShuttleXPosStatus]
kr=셔틀 X축 위치 상태
us=Shuttle X Axis Position Status

[GroupBox_ShuttleZSensorMap]
kr=셔틀 Z축 센서 맵
us=Shuttle Z Axis Sensor Map

[GroupBox_ShuttleZSensorStatus]
kr=셔틀 Z축 센서 상태
us=Shuttle Z Axis Sensor Status

[GroupBox_ShuttleZPosStatus]
kr=셔틀 Z축 위치 상태
us=Shuttle Z Axis Position Status

[GroupBox_ShuttleTSensorMap]
kr=셔틀 T축 센서 맵
us=Shuttle T Axis Sensor Map

[GroupBox_ShuttleTSensorStatus]
kr=셔틀 T축 센서 상태
us=Shuttle T Axis Sensor Status

[GroupBox_ShuttleTPosStatus]
kr=셔틀 T축 위치 상태
us=Shuttle T Axis Position Status

[GroupBox_BufferLPZSensorMap]
kr=버퍼 LP Z축 센서 맵
us=Buffer LP Z Axis Sensor Map

[GroupBox_BufferLPZSensorStatus]
kr=버퍼 LP Z축 센서 상태
us=Buffer LP Z Axis Sensor Status

[GroupBox_BufferLPZPosStatus]
kr=버퍼 LP Z축 위치 상태
us=Buffer LP Z Axis Position Status

[GroupBox_BufferOPZSensorMap]
kr=버퍼 OP Z축 센서 맵
us=Buffer OP Z Axis Sensor Map

[GroupBox_BufferOPZSensorStatus]
kr=버퍼 OP Z축 센서 상태
us=Buffer OP Z Axis Sensor Status

[GroupBox_BufferOPZPosStatus]
kr=버퍼 OP Z축 위치 상태
us=Buffer OP Z Axis Position Status

[GroupBox_BufferOPYSensorMap]
kr=버퍼 OP Y축 센서 맵
us=Buffer OP Y Axis Sensor Map

[GroupBox_BufferOPYSensorStatus]
kr=버퍼 OP Y축 센서 상태
us=Buffer OP Y Axis Sensor Status

[GroupBox_BufferOPYPosStatus]
kr=버퍼 OP Y축 위치 상태
us=Buffer OP Y Axis Position Status

[GroupBox_OHTPIOStatus]
kr=OHT PIO 상태
us=OHT PIO Status

[GroupBox_AGVPIOStatus]
kr=AGV PIO 상태
us=AGV PIO Status

[GroupBox_EQPIOStatus]
kr=EQ PIO 상태
us=EQ PIO Status

[GroupBox_OMRONPIOStatus]
kr=OMRON PIO 상태
us=OMRON PIO Status

[GroupBox_PortToOHT_ManualPIO]
kr=Port -> OHT 수동 PIO 조작
us=Port -> OHT Manual PIO Control

[GroupBox_PortToAGV_ManualPIO]
kr=Port -> AGV 수동 PIO 조작
us=Port -> AGV Manual PIO Control

[GroupBox_PortToOMRON_ManualPIO]
kr=Port -> OMRON 수동 PIO 조작
us=Port -> OMRON Manual PIO Control

[GroupBox_PortToRM_ManualPIO]
kr=Port(EQ) -> RackMaster 수동 PIO 조작
us=Port(EQ) -> RackMaster Manual PIO Control

[GroupBox_RackMasterMap]
kr=랙마스터 맵
us=RackMaster Map

[GroupBox_PortMap]
kr=포트 맵
us=Port Map

[GroupBox_Alarmnfo]
kr=알람 정보
us=Alarm Info

[GroupBox_PortAlarmList]
kr=포트 알람 리스트
us=Port Alarm List

[GroupBox_PortAlarmState]
kr=포트 알람 상태
us=Port Alarm State

[GroupBox_PortAlarmSolution]
kr=포트 알람 조치 방법
us=Port Alarm Solution

[GroupBox_MasterAlarmList]
kr=마스터 알람 리스트
us=Master Alarm List

[GroupBox_MasterAlarmState]
kr=마스터 알람 상태
us=Master Alarm State

[GroupBox_MasterAlarmSolution]
kr=마스터 알람 조치 방법
us=Master Alarm Solution

//Label
[Label_Monitoring]
kr=모니터링
us=Monitoring

[Label_Log]
kr=로그
us=Log

[Label_MasterAlarmCode]
kr=마스터 알람 코드
us=Master Alarm Code

[Label_MasterAlarmText]
kr=마스터 알람 내용
us=Master Alarm Text

[Label_CPUUsage]
kr=CPU 사용량
us=CPU Usage

[Label_RAMUsage]
kr=램 사용량
us=RAM Usage

[Label_WMXEngineStatus]
kr=WMX 엔진 상태
us=WMX Engine Status

[Label_ID]
kr=아이디
us=ID

[Label_CompressionCycle]
kr=로그 압축 주기
us=Log Compression Cycle

[Label_DeleteCycle]
kr=Zip 삭제 주기
us=Zip Delete Cycle

[Label_Password]
kr=비밀번호
us=Password

[Label_DurationTime]
kr=유지 시간
us=Duration Time

[Label_Language]
kr=언어
us=Language

[Label_MasterVersion]
kr=마스터 버전
us=Master Version

[Label_NowTime]
kr=현재 시간
us=Now Time

[Label_RemainingTime]
kr=로그인 남은 시간
us=Login Remaining Time

[Label_CycleCount]
kr=사이클 횟수
us=Cycle Count

[Label_AutoCycleStep]
kr=자동 공정 단계
us=Auto Cycle Step

[Label_AutoTeachingStep]
kr=자동 티칭 단계
us=Auto Teaching Step

[Label_AutoCycleError]
kr=자동 공정 오류
us=Auto Cycle Error

[Label_AutoTeachingError]
kr=자동 티칭 오류
us=Auto Teaching Error

[Label_AutoCycleProgressPercent]
kr=자동 공정 진행률
us=Auto Cycle Progress

[Label_AutoTeachingProgressPercent]
kr=자동 티칭 진행률
us=Auto Teaching Progress

[Label_AutoCycleTime]
kr=자동 공정 진행 시간
us=Auto Cycle Progress Time

[Label_AutoTeachingTime]
kr=자동 티칭 진행 시간
us=Auto Teaching Progress Time

[Label_PIOProgressTime]
kr=PIO 진행 시간
us=PIO Progress Time

[Label_LoadFilePath]
kr=로드 파일 경로
us=Load File Path

[Label_AllShelfCount]
kr=모든 Shelf 갯수
us=All Shelf Count

[Label_CheckedShelfCount]
kr=체크된 Shelf 갯수
us=Checked Shelf Count

[Label_ShelfID]
kr=Shelf 아이디
us=Shelf ID

[Label_TeachingStart_XPos]
kr=티칭 시작 X 위치
us=Teaching Start X Pos

[Label_TeachingStart_ZPos]
kr=티칭 시작 Z 위치
us=Teaching Start Z Pos

[Label_ShelfSearchState]
kr=Shelf 검색 상태
us=Shelf Search State

[Label_LowSpeed]
kr=저속
us=Low Speed

[Label_HighSpeed]
kr=고속
us=High Speed

[Label_InchingPos]
kr=이동 거리
us=Inching Pos

[Label_AbsolutePos]
kr=목표 위치
us=Target Pos

[Label_TargetPosition]
kr=명령 위치
us=Target Position

[Label_ActualPosition]
kr=현재 위치
us=Actual Position

[Label_OPPos]
kr=OP 위치 값
us=OP Position

[Label_LPPos]
kr=LP 위치 값
us=LP Position

[Label_WaitPos]
kr=Wait 위치 값
us=Wait Position

[Label_UpPos]
kr=Up 위치 값
us=Up Position

[Label_DownPos]
kr=Down 위치 값
us=Down Position

[Label_0DegPos]
kr=0 Degree 위치 값
us=0 Degree Position

[Label_180DegPos]
kr=180 Degree 위치 값
us=180 Degree Position

[Label_XAxisSpeed]
kr=X 축 속도
us=X Axis Speed

[Label_ZAxisSpeed]
kr=Z 축 속도
us=Z Axis Speed

[Label_AAxisSpeed]
kr=A 축 속도
us=A Axis Speed

[Label_TAxisSpeed]
kr=T 축 속도
us=T Axis Speed

[Label_AppliedValue]
kr=적용된 값
us=Applied value

[Label_SetValue]
kr=설정 값
us=Set value

[Label_DetectValue]
kr=검출된 값
us=Detected Value

[Label_XAxisLoad]
kr=X 축 최대 부하
us=X Axis Max Load

[Label_ZAxisLoad]
kr=Z 축 최대 부하
us=Z Axis Max Load

[Label_AAxisLoad]
kr=A 축 최대 부하
us=A Axis Max Load

[Label_TAxisLoad]
kr=T 축 최대 부하
us=T Axis Max Load

[Label_HighSpeedBWD]
kr=고속 후진
us=High Speed BWD

[Label_LowSpeedBWD]
kr=저속 후진
us=Low Speed BWD

[Label_LowSpeedFWD]
kr=저속 전진
us=Low Speed FWD

[Label_HighSpeedFWD]
kr=고속 전진
us=High Speed FWD

[Label_BWD]
kr=후진
us=BWD

[Label_FWD]
kr=전진
us=FWD

[Label_BufferSelect]
kr=버퍼 선택
us=Buffer Select

[Label_BaseShelfID]
kr=기준 쉘프 ID
us=Base Shelf ID

[Label_BaseShelfXPos]
kr=기준 쉘프 X 위치
us=Base Shelf X Pos

[Label_BaseShelfZPos]
kr=기준 쉘프 Z 위치
us=Base Shelf Z Pos

[Label_IntervalX]
kr=X 간격
us=X Interval

[Label_IntervalZ]
kr=Z 간격
us=Z Interval

[Label_ColumnCount]
kr=열 개수
us=Column Count

[Label_RowCount]
kr=행 개수
us=Row Count

[Label_StartShelfID]
kr=시작 쉘프 ID
us=Start Shelf ID

[Label_EndShelfID]
kr=종료 쉘프 ID
us=End Shelf ID

[Label_OffsetX]
kr=X 오프셋
us=X Offset

[Label_OffsetZ]
kr=Z 오프셋
us=Z Offset



//DataGridView
[DGV_GenerateTime]
kr=발생 시간
us=Generate Time

[DGV_LogType]
kr=로그 유형
us=Log Type

[DGV_LogLevel]
kr=로그 레벨
us=Log Level

[DGV_LogTitle]
kr=로그 제목
us=Log Title

[DGV_LogComment]
kr=로그 코멘트
us=Log Comment

[DGV_List]
kr=항목
us=List

[DGV_Bit]
kr=비트
us=Bit

[DGV_ErrorName]
kr=에러 이름
us=Error Name

[DGV_ErrorCode]
kr=에러 코드
us=Error Code

[DGV_Clear]
kr=초기화
us=Clear

[DGV_ClearTime]
kr=초기화 시간
us=Clear Time

[DGV_Name]
kr=이름
us=Name

[DGV_Status]
kr=상태
us=Status

[DGV_Axis]
kr=축
us=Axis

[DGV_ServoAxis]
kr=서보 축
us=Servo Axis

[DGV_InverterAxis]
kr=인버터 축
us=Inverter Axis

[DGV_CylinderAxis]
kr=실린더 축
us=Cylinder Axis

[DGV_CVBuffer]
kr=컨베이어 버퍼
us=Conveyor Buffer

[DGV_CVOption]
kr=컨베이어 옵션
us=Conveyor Option


[DGV_HighSpeedBWD]
kr=고속 후진
us=High Speed BWD

[DGV_LowSpeedBWD]
kr=저속 후진
us=Low Speed BWD

[DGV_LowSpeedFWD]
kr=저속 전진
us=Low Speed FWD

[DGV_HighSpeedFWD]
kr=고속 전진
us=High Speed FWD

[DGV_HighSpeed]
kr=고속
us=High Speed

[DGV_LowSpeed]
kr=저속
us=Low Speed

[DGV_BWD]
kr=후진
us=BWD

[DGV_FWD]
kr=전진
us=FWD

[DGV_BWDStatus]
kr=후진 상태
us=BWD Status

[DGV_FWDStatus]
kr=전진 상태
us=FWD Status

[DGV_Command]
kr=명령
us=Command

[DGV_Servo]
kr=서보
us=Servo

[DGV_Home]
kr=홈
us=Home

[DGV_Busy]
kr=동작
us=Busy

[DGV_PosCommand]
kr=명령 위치
us=Pos Cmd

[DGV_ActualPos]
kr=현재 위치
us=Act Pos

[DGV_ActualVel]
kr=현재 속도
us=Act Vel

[DGV_ActualTorque]
kr=현재 토크
us=Act Torque

[DGV_AlarmCode]
kr=알람 코드
us=Alarm Code

[DGV_NOT]
kr=(-)리밋
us=NOT

[DGV_POT]
kr=(+)리밋
us=POT

[DGV_HOMESwitch]
kr=홈 스위치
us=Home

[DGV_PosSensor]
kr=Pos 센서
us=Pos Sensor

[DGV_HomeDone]
kr=홈 완료
us=Origin OK

[DGV_BWD]
kr=후진
us=BWD

[DGV_FWD]
kr=전진
us=FWD

[DGV_WaitSensor]
kr=Wait 센서
us=Wait Sensor

[DGV_0DegSensor]
kr=0도 센서
us=0 Deg Sensor

[DGV_180DegSensor]
kr=180도 센서
us=180 Deg Sensor

[DGV_ETC1]
kr=외부 센서1
us=ETC Sensor1

[DGV_ETC2]
kr=외부 센서2
us=ETC Sensor2

[DGV_CST1]
kr=CST 적재1
us=CST Load1

[DGV_CST2]
kr=CST 적재2
us=CST Load2

[DGV_Presence]
kr=대각
us=diagonal

[DGV_Hoist]
kr=호이스트
us=Hoist

[DGV_Cart1]
kr=대차1
us=Cart1

[DGV_Cart2]
kr=대차2
us=Cart2

[DGV_LightCurtain]
kr=Light.C
us=Light.C

[DGV_Green]
kr=G LED Bar
us=G LED Bar

[DGV_Red]
kr=R LED Bar
us=R LED Bar

[DGV_ForkDetect]
kr=포크
us=Fork

[DGV_BufferCVIn]
kr=CV IN
us=CV IN

[DGV_BufferCVOut]
kr=CV Out
us=CV Out

[DGV_BufferCVError]
kr=CV Error
us=CV Error

[DGV_Buffer_Z_Axis_NOT]
kr=Z NOT
us=Z NOT

[DGV_Buffer_Z_Axis_Pos1]
kr=Z Pos1
us=Z POS1

[DGV_Buffer_Z_Axis_Pos2]
kr=Z POS2
us=Z POS2

[DGV_Buffer_Z_Axis_POT]
kr=Z POT
us=Z POT

[DGV_Buffer_Z_Axis_Error]
kr=Z Error
us=Z Error

[DGV_Buffer_Inplace1]
kr=IN PLACE1
us=IN PLACE1

[DGV_Buffer_Inplace2]
kr=IN PLACE2
us=IN PLACE2

[DGV_CV_Forwarding]
kr=CV 전진
us=CV FWD

[DGV_CV_Backwarding]
kr=CV 후진
us=CV BWD

[DGV_Buffer1]
kr=버퍼1(OP)
us=Buffer1(OP)

[DGV_Buffer2]
kr=버퍼2(LP)
us=Buffer2(LP)

[DGV_CVCST]
kr=CV 카세트
us=CV CST

[DGV_Shuttle]
kr=셔틀
us=Shuttle

[DGV_Shuttle_X_Axis]
kr=셔틀 X
us=Shuttle X

[DGV_Shuttle_Z_Axis]
kr=셔틀 Z
us=Shuttle Z

[DGV_Shuttle_T_Axis]
kr=셔틀 T
us=Shuttle T

[DGV_RM_AAxis_OriginPos]
kr=Arm 축 정위치 센서
us=Arm Axis Origin Pos Detection

[DGV_RM_TAxis_LeftOriginPos]
kr=Turn 축 정위치 센서(좌측)
us=Turn Axis Origin Pos Detection(Left)

[DGV_RM_TAxis_RightOriginPos]
kr=Turn 축 정위치 센서(우측)
us=Turn Axis Origin Pos Detection(Right)

[DGV_InputVoltage]
kr=입력 전압
us=Input Voltage

[DGV_OutputVoltage]
kr=출력 전압
us=Output Voltage

[DGV_InputVoltage]
kr=출력 전류
us=Output Current

[DGV_PickupTemp]
kr=Pickup 온도
us=Pickup Temp

[DGV_HeatsinkTemp]
kr=방열판 온도
us=Heatsink Temp

[DGV_InnerTemp]
kr=내부 온도
us=Inner Temp

[DGV_PortToRM]
kr=포트 -> 랙마스터
us=Port -> RackMaster

[DGV_RMToPort]
kr=랙마스터 -> 포트
us=RackMaster -> Port

[DGV_ShelfID]
kr=Shelf 아이디
us=Shelf ID

[DGV_TeachingXPos]
kr=티칭 X 시작 위치 [mm]
us=Teaching Start X Pos [mm]

[DGV_TeachingZPos]
kr=티칭 Z 시작 위치 [mm]
us=Teaching Start Z Pos [mm]

[DGV_TeachingResult]
kr=티칭 진행 상태
us=Teaching State

[DGV_Port]
kr=포트
us=Port

[DGV_ParameterName]
kr=매개변수 이름
us=Parameter Name

[DGV_AppliedValue]
kr=적용된 값
us=Applied value

[DGV_SetValue]
kr=설정 값
us=Set value

[DGV_WatchdogList]
kr=와치독 매개변수 이름
us=Watchdog Parameter Names

[DGV_AppliedDetectTime]
kr=적용된 검출 시간 [밀리초]
us=Applied Detect Time [msec]

[DGV_ProgressTime]
kr=진행 시간 [시간, 밀리초]
us=Progress Time [Time, msec]

[DGV_SetDetectTime]
kr=설정 검출 시간 [밀리초]
us=Set Detect Time [msec]

[DGV_SaftyIOName]
kr=안전 입출력 이름
us=Safty I/O Name

[DGV_SaftyIOStatus]
kr=안전 입출력 상태
us=Safty I/O Status

[DGV_Equipment]
kr=설비
us=Equipment

[DGV_Auto]
kr=자동 상태
us=Auto Status

[DGV_ControlMode]
kr=제어 모드
us=Control Mode

[DGV_Power]
kr=파워
us=Equipment

[DGV_ErrorStatus]
kr=에러
us=Error

[DGV_Control]
kr=제어
us=Control

[DGV_Number]
kr=번호
us=Number

[DGV_SensorName]
kr=센서 이름
us=Sensor Name

[DGV_SensorStatus]
kr=센서 상태
us=Sensor Status

[DGV_Index]
kr=인덱스
us=Index

[DGV_Hex]
kr=헥스
us=Hex

[DGV_AlarmName]
kr=알람 이름
us=Alarm Name

[DGV_AlarmState]
kr=알람 상태
us=Alarm State


//Tab Name
[TabPage_EquipmentSaftyStates]
kr=설비 안전 상태
us=Equipment Safty States

[TabPage_EquipmentControls]
kr=설비 제어
us=Equipment Controls

[TabPage_MonitoringMap]
kr=설비 모니터링
us=Equipment Monitoring

[TabPage_PortControlParam]
kr=포트 제어 파라미터
us=Port Control Param

[TabPage_ConveyorControlParam]
kr=컨베이어 제어 파라미터
us=Conveyor Control Param

[TabPage_ServoParam]
kr=서보 파라미터(WMX)
us=Servo Parameter(WMX)

[TabPage_IOParam]
kr=입출력 파라미터(WMX)
us=I/O Parameter(WMX)

[TabPage_PortSafty]
kr=포트 안전
us=Port Safty

[TabPage_IDReader]
kr=카세트 ID 리더
us=Cassette ID Reader

[TabPage_BufferIO]
kr=버퍼 I/O
us=Buffer I/O

[TabPage_CVBufferIO]
kr=컨베이어 버퍼 I/O
us=Conveyor Buffer I/O

[TabPage_AGV]
kr=AGV PIO
us=AGV PIO

[TabPage_OMRON]
kr=OMRON PIO
us=OMRON PIO

[TabPage_OHT]
kr=OHT PIO
us=OHT PIO

[TabPage_EQ]
kr=EQ PIO
us=EQ PIO

[TabPage_Shuttle_T]
kr=셔틀 T 축 I/O
us=Shuttle T Axis I/O

[TabPage_Shuttle_X]
kr=셔틀 X 축 I/O
us=Shuttle X Axis I/O

[TabPage_Shuttle_Z]
kr=셔틀 Z 축 I/O
us=Shuttle Z Axis I/O

[TabPage_BufferLP_ZAxis]
kr=버퍼 LP Z 축 I/O
us=Buffer LP Z Axis I/O

[TabPage_BufferOP_ZAxis]
kr=버퍼 OP Z 축 I/O
us=Buffer OP Z Axis I/O

[TabPage_BufferOP_YAxis]
kr=버퍼 OP Y 축 I/O
us=Buffer OP Y Axis I/O

[TabPage_TableGenerator]
kr=테이블 생성
us=Table Generator

[TabPage_XZOffsetCalculator]
kr=X, Z 오프셋 계산
us=X, Z Offset Calculator



//Form Title
[Frm_Main_FormTitle]
kr=시너스텍 마스터 프로그램
us=Synustech Master Program

[Frm_Login_FormTitle]
kr=로그인
us=Login

[Frm_LogSet_FormTitle]
kr=로그 설정
us=Log Settings

[Frm_Language_FormTitle]
kr=언어 설정
us=Language Setting

[Frm_EquipNetworkSettings_FormTitle]
kr=장비 설정
us=Equipment Setting

[Frm_EquipMotionSettings_FormTitle]
kr=모션 설정
us=Motion Setting


//Message
[ErrorMessage]
kr=에러 메세지
us=Error Message

[WarningMessage]
kr=경고 메세지
us=WarningMessage

[InfoMessage]
kr=안내 메세지
us=Information Message


//Global Message
[Message_PermissionError]
kr=설정 권한이 없습니다. 관리자 레벨로 로그인 하세요.
us=You do not have permission to set. Log in with administrator level.

[Message_Login_ExtendLogin]
kr=Login 을 연장하시겠습니까?
us=Do you want to extend Login?

[Message_QuickStopDecValueError]
kr=퀵 스탑 감속 값 설정 오류
us=Quick Stop Decel Set Error

[Message_RejectCommandInWorking]
kr=공정 중에는 명령할 수 없습니다.
us=You cannot command in work state.

[Message_IDErrorMessageStr]
kr=존재하지 않는 ID 입니다
us=This ID does not exist

[Message_PasswordErrorMessageStr]
kr=Password가 일치하지 않습니다
us=Passwords do not match

[Message_PortNumberRangeError]
kr=포트 번호 오류 (0 ~ 65535)
us=Port number error (0 to 65535)

[Message_MemoryMapStartAddrRangeError]
kr=메모리 맵 시작 주소 오류
us=Meomory Map start address error

[Message_BitMapSizeRangeError]
kr=비트 맵 사이즈 오류
us=Bitmap size error

[Message_ByteSizeError]
kr=바이트 사이즈 오류
us=Byte size error

[Message_WordMapSizeRangeError]
kr=워드 맵 사이즈 오류
us=Wordmap size error

[Message_CIM_NetworkSettingError]
kr=CIM 네트워크 또는 장비 설정 오류
us=CIM network or device configuration error

[Message_RackMaster_NetworkSettingError]
kr=랙마스터 네트워크 또는 장비 설정 오류
us=Rackmaster network or equipment configuration error

[Message_Port_NetworkSettingError]
kr=포트 네트워크 또는 장비 설정 오류
us=Port network or device configuration error

[Message_RackMaster_Count_Add_Error]
kr=RackMaster는 2대 이상 추가할 수 없습니다.
us=You cannot add more than 2 RackMasters.

[Message_InvalidIDError]
kr=유효한 ID 값이 아닙니다
us=Invalid ID Value

[Message_IDDupleError]
kr=ID 값이 중복됩니다.
us=Duple ID Value

[Message_InvalidIPAddressError]
kr=유효한 IP 주소가 아닙니다.
us=This is not a valid IP address.

[Message_AxisRangeError]
kr=축 번호 설정 오류 (0 ~ 127)
us=Axis number setting error (0 ~ 127)

[Message_Port_MotionSettingError]
kr=포트 Motion 설정 값 설정 오류
us=Port Motion setting value setting error

[Message_FilePathLengthOver]
kr=파일 경로의 텍스트 길이가 255개의 글자를 초과하였습니다.
us=The length of the file path is greater than 255 bytes.

[Message_NotLoadedFile]
kr=파일이 로드되지 않았습니다.
us=Teaching file is not loaded.

[Message_SaveSuccess]
kr=저장 완료
us=Save Success

[Message_SaveFail]
kr=저장 실패
us=Save Fail

[Message_DupleError]
kr=I/O 주소 중복 에러
us=Duplicate I/O address error

[Message_ApplyFail]
kr=적용 실패
us=Apply Fail

[Message_InvalidCurrentCell]
kr=선택된 행 정보가 없습니다.
us=No row information selected.

[Message_InvalidTopCell]
kr=선택된 행이 최 상위에 위치합니다.
us=The selected row is at the top.

[Message_InvalidDownCell]
kr=선택된 행이 최 하위에 위치합니다.
us=The selected row is located at the bottom.

[Message_InvalidTeachingParamError]
kr=잘못된 티칭 데이터 입니다. Shelf 또는 선택한 Cell의 State를 확인하세요.
us=Incorrect teaching data. Check the state of the shelf or selected cell.

[Message_ApplyResult]
kr=입력 값을 정말 적용하시겠습니까?
us=Do you really apply the set values?

[Message_Invalid_Data_Error]
kr=값의 정상 범위를 넘어갔습니다. (Value > 0)
us=The value is out of range. (Value > 0)

[Message_Invalid_ShelfID_Error]
kr=Shelf ID의 정상 범위를 넘어갔습니다. (10101 <= Value <= 2xxxx)
us=The Shelf ID is out of range. (10101 <= Value <= 2xxxx)

[Message_Failed_to_Get_Shelf_Data]
kr=랙마스터 응답시간이 초과하였습니다. (Timeout = 5s)
us=RackMaster Response Timeover. (Timeout = 5s)



//Port Interlock Message
[Message_Port_InCycleControl]
kr=포트 수동 Cycle 공정 중, 명령할 수 없습니다.
us=During port manual cycle process, command is not available.

[Message_Port_EnableStateError]
kr=동작을 위한 Enable State가 off 상태 입니다.
us=Enable State for operation is off.

[Message_Port_AlreadyPowerOnState]
kr=포트가 Power On 상태 입니다.
us=The port is in Power On state.

[Message_Port_InAutoControl]
kr=포트 자동 공정 중, 명령할 수 없습니다.
us=During port auto process, command is not available.

[Message_Port_InBusyState]
kr=포트 동작 중, 명령할 수 없습니다.
us=During port operation, command is not available.

[Message_Port_IntNotHomeDone]
kr=포트의 원점 상태가 off 상태 입니다.
us=The port origin state is off.

[Message_Port_AlarmStateError]
kr=포트가 Alarm 상태 입니다.
us=The port is in Alarm state.

[Message_Port_InEStopState]
kr=포트가 E-Stop Error 상태 입니다.
us=Port is in E-Stop Error state.

[Message_Port_InvalidIOParameter]
kr=유효하지 않은 IO 값 입니다.
us=Invalid IO value.

[Message_Port_InvalidSpeedError]
kr=유효하지 않은 속도 값을 설정하였습니다.
us=An invalid speed value was set.

[Message_Port_InvalidInchingError]
kr=유효하지 않은 인칭 값을 설정하였습니다. (Value > 0)
us=You have set an invalid inching value. (Value > 0)

[Message_Port_OHTDoorKeyClose]
kr=OHT Door Key 상태가 Close 상태입니다.
us=OHT Door Key is in Close Location.

[Message_Port_OHTDoorKeyOpen]
kr=OHT Door Key 상태가 Open 상태입니다.
us=OHT Door Key is in Open Location.

[Message_Port_OHTDoorOpen]
kr=OHT Door 상태가 Open 상태입니다.
us=OHT Door is Opened.

[Message_Port_OHTDoorClose]
kr=OHT Door 상태가 Close 상태입니다.
us=OHT Door is Closed.

[Message_Port_Limit_Error]
kr=포트가 Limit 에러 상태입니다.
us=The port is in a limit error state.

[Message_Port_X_Axis_Not_Wait_Pos]
kr=포트의 X 축이 Wait Position에 위치하지 않습니다.
us=The port X-axis is not in the Wait Position.

[Message_Port_X_Axis_Not_LP_Pos]
kr=포트의 X 축이 LP Position에 위치하지 않습니다.
us=The port X-axis is not in the LP Position.

[Message_Port_Z_Axis_Not_Up_Pos]
kr=포트의 Z 축이 Up Position에 위치하지 않습니다. (셔틀에 캐리어 존재)
us=The port Z-axis is not in Up Position. (Carrier Exist in Shuttle)

[Message_Port_Z_Axis_Not_Down_Pos]
kr=포트의 Z 축이 Down Position에 위치하지 않습니다. (OP에 캐리어 존재)
us=The port Z-axis is not in Down Position. (Carrier Exist in Shuttle)

[Message_Port_DeadMan_Status]
kr=GOT의 DeadMan Status가 Off 상태 입니다.
us=DeadMan Status of GOT is Off.

[Message_Crash_Interlock_Status]
kr=T 축의 충돌이 예상 됩니다. 인접 포트의 각도를 확인하세요.
us=A collision on the T axis is expected. Check the angle of adjacent ports.

[Message_Port_Z_Axis_DoNotMove_Down]
kr=해당 위치에서 포트의 Z 축을 Down 위치로 이동할 수 없습니다. (셔틀에 캐리어 존재)
us=From that position, you cannot move the port Z-axis to the Down position. (Carrier Exist in Shuttle)

[Message_Port_Y_Axis_Not_BWD_Location]
kr=Y 축이 BWD 위치에 있지 않습니다.
us=Y Axis is not BWD Location.

[Message_Port_Z_Axis_Not_Up_Location]
kr=Z 축이 Up 위치에 있지 않습니다.
us=Z Axis is not Up Location.

[Message_Port_X_Axis_DoNotMove_OP]
kr=포트의 X 축을 OP 위치로 이동할 수 없습니다. (셔틀 및 OP에 캐리어 존재)
us=The port X-axis cannot be moved to the OP position. (Carrier Exist in Shuttle and OP)

[Message_Port_X_Axis_DoNotMove_LP]
kr=포트의 X 축을 LP 위치로 이동할 수 없습니다. (셔틀 및 LP에 캐리어 존재)
us=The port X-axis cannot be moved to the LP position. (Carrier Exist in Shuttle and LP)

[Message_Port_T_Axis_Not_Parallel_Pos]
kr=포트의 T 축이 평행 방향에 위치하지 않습니다.
us=The T-axis of the port is not positioned in the parallel direction.

[Message_Port_AutoModeStop]
kr=포트 자동 공정을 정말 중지 하시겠습니까?
us=Are you sure you want to stop the Port automatic process?

[Message_Port_AutoManualCycleModeStop]
kr=포트 매뉴얼 공정을 정말 중지 하시겠습니까?
us=Are you sure you want to stop the Port Manual process?

[Message_Port_InCIMMode]
kr=포트가 CIM Mode 입니다.
us=Port is in CIM Mode.

[Message_Port_AxisalreadyHomeDone]
kr=축이 원점 검색 완료 상태입니다. 초기화 하시겠습니까?
us=The axis is in the home search complete state. Are you sure you want to reset it?

[Message_Port_ParameterSetError]
kr=파라미터 저장 실패
us=Parameter Save Fail

[Message_Port_ApplyAndSaveResult]
kr=설정 값이 포트에 적용 및 파일로 저장됩니다. 진행 하시겠습니까?
us=The setted value is applied to the port and saved as a file. Would you like to proceed?

[Message_Port_ApplyPortResult]
kr=입력된 값이 포트에 저장됩니다. 진행 하시겠습니까?
us=The entered value is saved in the port. Would you like to proceed?

[Message_Port_ApplyAllPortResult]
kr=입력된 값이 모든 포트에 저장됩니다. 진행 하시겠습니까?
us=The entered values ​​are saved to all ports. Would you like to proceed?

[Message_Port_AxisManualNotDefine]
kr=해당 축에 대한 Manual 경로가 지정되지 않았습니다.
us=No manual path has been specified for that axis.

[Message_Port_AxisManualFileNotExist]
kr=해당 축에 대한 Manual 경로에 파일이 존재하지 않습니다.
us=The file does not exist in the manual path for that axis.

[Message_Port_InvalidQuickStopDec]
kr=퀵 스탑 감속 값이 오토 또는 매뉴얼 감속 속도보다 작습니다.
us=The quick stop deceleration value is smaller than the auto or manual deceleration rate.

[Message_Port_InvalidDirection]
kr=공정 방향 오류. 포트 또는 From ID를 변경해주세요.
us=Error in process direction. Please change the port or From ID.

[Message_Port_Not_Exist_CST]
kr=CST가 존재하지 않습니다. ID를 부여할 수 없습니다.
us=CST does not exist. ID cannot be given.

//RackMaster Interlock Message
[Message_RackMaster_TCPIPDisconnection]
kr=TCP/IP 연결이 끊어진 상태입니다.
us=The TCP/IP connection is in a broken state.

[Message_RackMaster_AutoModeStop]
kr=랙마스터 자동 공정을 정말 중지 하시겠습니까?
us=Are you sure you want to stop the Rackmaster automatic process?

[Message_RackMaster_InCIMMode]
kr=랙마스터가 CIM Mode 입니다.
us=Rackmaster is in CIM Mode.

[Message_RackMaster_EnableStateError]
kr=동작을 위한 Enable State가 off 상태 입니다.
us=Enable State for operation is off.

[Message_RackMaster_InAutoMode]
kr=랙마스터가 오토 모드 상태입니다.
us=RackMaster is Auto Mode Status.

[Message_RackMaster_InNotAutoMode]
kr=랙마스터가 오토 모드 상태가 아닙니다.
us=RackMaster is Not Auto Mode Status.

[Message_RackMaster_InAutoCycleRun]
kr=랙마스터가 오토 사이클 공정 상태입니다.
us=RackMaster is Auto Cycle Running Status.

[Message_RackMaster_InNotTeachingRW]
kr=랙마스터의 Teaching R/W Enable Bit가 Off 상태입니다.
us=RackMaster Teaching R/W Enable Bit is Off.

[Message_RackMaster_InAutoTeachingRun]
kr=랙마스터가 오토 티칭 공정 상태입니다.
us=RackMaster is Auto Teaching Running Status.

[Message_RackMaster_InDoorOpenState]
kr=도어 오픈 상태입니다.
us=Door Open State.

[Message_RackMaster_InMasterKeyManual]
kr=마스터 키가 매뉴얼 상태입니다.
us=Master Key is manual state.

[Message_RackMaster_DonotFindShelfInFileError]
kr=파일에서 Shelf 정보를 찾을 수 없습니다.
us=Shelf information could not be found in the file.

[Message_RackMaster_DonotCheckingInFileError]
kr=파일에서 체크된 Shelf 정보를 찾을 수 없습니다.
us=The checked shelf information could not be found in the file.


//Master Message
[Message_Master_WMXCommunicationStart]
kr=통신 연결을 다시 시도하시겠습니까?
us=Would you like to retry the communication connection?

[Message_Master_WMXHotConnectStart]
kr=핫 커넥션을 시도 하시겠습니까?
us=Would you like to try the Hot connection?

//Application Message
[Message_App_NetworkParamLoadError]
kr=네트워크 설정 파일 로드 오류
us=Error loading network configuration file.


//Port Alarm Solution
[PortAlarm_Port_E_Stop_Solution]
kr=포트 출입부의 E Stop Switch의 눌림 상태를 확인하세요.
us=Check the pressed state of the E Stop Switch on the port entrance.

[PortAlarm_GOT_E_Stop_Solution]
kr=포트 GOT(Handy Touch) E Stop Switch의 눌림 상태를 확인하세요.
us=Check the pressed state of the port GOT (Handy Touch) E Stop Switch.

[PortAlarm_Power_Off_Error_Solution]
kr=포트가 오토 상태 또는 사이클 상태에서 전원이 오프된 경우 발생합니다. 포트 구성 슬레이브의 전원 투입 상태를 확인하세요.
us=Occurs when the power is turned off while the port is in auto or cycle state. Check the power-on status of the port configuration slave.

[PortAlarm_Key_Switch_Error_Solution]
kr=포트가 오토 상태 또는 사이클 상태에서 [OHT Mode -> Key Close], [MGV Mode -> Key Open] 상태를 확인하세요.
us=Check the status of [OHT Mode -> Key Close] and [MGV Mode -> Key Open] when the port is in auto or cycle state.

[PortAlarm_Door_Open_Error_Solution]
kr=포트가 오토 상태 또는 사이클 상태에서 [OHT Mode -> Door Close], [MGV Mode -> Door Open] 상태를 확인하세요.
us=Check the status of [OHT Mode -> Door Close] and [MGV Mode -> Door Open] when the port is in auto or cycle state.

[PortAlarm_WMX_E_Stop_Solution]
kr=WMX Engine의 Emergency Stop 상태를 확인하세요.
us=Check the Emergency Stop status of WMX Engine.

[PortAlarm_Software_E_Stop_Solution]
kr=포트 제어 화면의 E Stop 버튼의 눌림 상태를 확인하세요.
us=Check the pressed state of the E Stop button on the Port Control screen.

[PortAlarm_Master_E_Stop_Solution]
kr=마스터의 E Stop 상태를 확인하세요.
us=Check The Master E Stop status.

[PortAlarm_X_Axis_ServoPack_Battery_Low_Alarm_Solution]
kr=X축 서보 앰프에 장착된 배터리의 전압 상태를 확인하세요.
us=Check the voltage status of the battery mounted on the X-axis servo amplifier.

[PortAlarm_Z_Axis_ServoPack_Battery_Low_Alarm_Solution]
kr=Z축 서보 앰프에 장착된 배터리의 전압 상태를 확인하세요.
us=Check the voltage status of the battery mounted on the Z-axis servo amplifier.

[PortAlarm_T_Axis_ServoPack_Battery_Low_Alarm_Solution]
kr=T축 서보 앰프에 장착된 배터리의 전압 상태를 확인하세요.
us=Check the voltage status of the battery mounted on the T-axis servo amplifier.

[PortAlarm_X_Axis_ServoPack_Error_Solution]
kr=X축 서보 앰프의 알람 상태를 확인하세요.
us=Check the alarm status of the X-axis servo amplifier.

[PortAlarm_Z_Axis_ServoPack_Error_Solution]
kr=Z축 서보 앰프의 알람 상태를 확인하세요.
us=Check the alarm status of the Z-axis servo amplifier.

[PortAlarm_T_Axis_ServoPack_Error_Solution]
kr=T축 서보 앰프의 알람 상태를 확인하세요.
us=Check the alarm status of the T-axis servo amplifier.

[PortAlarm_X_Axis_POT_Solution]
kr=X축 서보 앰프의 POT 센서 상태를 확인하세요.
us=Check the status of the POT sensor of the X-axis servo amplifier.

[PortAlarm_Z_Axis_POT_Solution]
kr=Z축 서보 앰프의 POT 센서 상태를 확인하세요.
us=Check the status of the POT sensor of the Z-axis servo amplifier.

[PortAlarm_T_Axis_POT_Solution]
kr=T축 서보 앰프의 POT 센서 상태를 확인하세요.
us=Check the status of the POT sensor of the T-axis servo amplifier.

[PortAlarm_X_Axis_NOT_Solution]
kr=X축 서보 앰프의 NOT 센서 상태를 확인하세요.
us=Check the status of the NOT sensor of the X-axis servo amplifier.

[PortAlarm_Z_Axis_NOT_Solution]
kr=Z축 서보 앰프의 NOT 센서 상태를 확인하세요.
us=Check the status of the NOT sensor of the Z-axis servo amplifier.

[PortAlarm_T_Axis_NOT_Solution]
kr=T축 서보 앰프의 NOT 센서 상태를 확인하세요.
us=Check the status of the NOT sensor of the T-axis servo amplifier.

[PortAlarm_X_Axis_Origin_Search_Fail_Solution]
kr=Homing 진행 중 NOT or POT 센서 감지 시 발생합니다. Home 센서 위치 및 Homing 방향을 확인 하세요.
us=Occurs when NOT or POT sensor is detected during homing. Check the home sensor location and homing direction.

[PortAlarm_Z_Axis_Origin_Search_Fail_Solution]
kr=Homing 진행 중 NOT or POT 센서 감지 시 발생합니다. Home 센서 위치 및 Homing 방향을 확인 하세요.
us=Occurs when NOT or POT sensor is detected during homing. Check the home sensor location and homing direction.

[PortAlarm_T_Axis_Origin_Search_Fail_Solution]
kr=Homing 진행 중 NOT or POT 센서 감지 시 발생합니다. Home 센서 위치 및 Homing 방향을 확인 하세요.
us=Occurs when NOT or POT sensor is detected during homing. Check the home sensor location and homing direction.

[PortAlarm_X_Axis_Software_Limit_Error_Solution]
kr=Software에서 설정한 Limit 위치 감지 시 발생합니다. 설정 값 및 현재 위치를 확인하세요.
us=Occurs when the limit position set by the software is detected. Check the setting value and current location.

[PortAlarm_Z_Axis_Software_Limit_Error_Solution]
kr=Software에서 설정한 Limit 위치 감지 시 발생합니다. 설정 값 및 현재 위치를 확인하세요.
us=Occurs when the limit position set by the software is detected. Check the setting value and current location.

[PortAlarm_T_Axis_Software_Limit_Error_Solution]
kr=Software에서 설정한 Limit 위치 감지 시 발생합니다. 설정 값 및 현재 위치를 확인하세요.
us=Occurs when the limit position set by the software is detected. Check the setting value and current location.

[PortAlarm_X_Axis_Dest_Position_Error_Encorder_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_Z_Axis_Dest_Position_Error_Encorder_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_T_Axis_Dest_Position_Error_Encorder_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_X_Axis_Absolute_Origin_Loss_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_Z_Axis_Absolute_Origin_Loss_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_T_Axis_Absolute_Origin_Loss_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_X_Axis_Dest_Positioning_Complete_Error_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_Z_Axis_Dest_Positioning_Complete_Error_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_T_Axis_Dest_Positioning_Complete_Error_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_X_Axis_OverLoad_Error_Solution]
kr=Software에서 설정한 과부하 설정 값 이상 감지 시 발생합니다. 설정 값 및 부하를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when an error in the overload setting value set in the software is detected. Check the set value and load. (Change the value on the settings page).

[PortAlarm_Z_Axis_OverLoad_Error_Solution]
kr=Software에서 설정한 과부하 설정 값 이상 감지 시 발생합니다. 설정 값 및 부하를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when an error in the overload setting value set in the software is detected. Check the set value and load. (Change the value on the settings page).

[PortAlarm_T_Axis_OverLoad_Error_Solution]
kr=Software에서 설정한 과부하 설정 값 이상 감지 시 발생합니다. 설정 값 및 부하를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when an error in the overload setting value set in the software is detected. Check the set value and load. (Change the value on the settings page).

[PortAlarm_X_Axis_HomeSensor_Always_On_Error_Solution]
kr=Home 완료 상태로 LP 위치에서 +-5mm 벗어났을 때 Home 센서가 켜져 있는 경우 발생합니다. Sensor 위치 확인 및 조정 필요.
us=Occurs when the home sensor is turned on when +-5mm is away from the LP position in the home complete state. Sensor location check and adjustment required.

[PortAlarm_Z_Axis_HomeSensor_Always_On_Error_Solution]
kr=Home 완료 상태로 Down 위치에서 +-12mm 벗어났을 때 Home 센서가 켜져 있는 경우 발생합니다. Sensor 위치 확인 및 조정 필요.
us=Occurs when the home sensor is turned on when +-12mm is away from the Down position in the home complete state. Sensor location check and adjustment required.

[PortAlarm_T_Axis_HomeSensor_Always_On_Error_Solution]
kr=Home 완료 상태로 0도 위치에서 +-5도 벗어났을 때 Home 센서가 켜져 있는 경우 발생합니다. Sensor 위치 확인 및 조정 필요.
us=Occurs when the home sensor is turned on when +-5Degree is away from the 0 Degree position in the home complete state. Sensor location check and adjustment required.

[PortAlarm_X_Axis_HomeMove_TimeOutError_Solution]
kr=Homing 동작이 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when homing operation detects more than the time set in the software. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_Z_Axis_HomeMove_TimeOutError_Solution]
kr=Homing 동작이 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when homing operation detects more than the time set in the software. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_T_Axis_HomeMove_TimeOutError_Solution]
kr=Homing 동작이 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when homing operation detects more than the time set in the software. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_X_Axis_Dest_Position_Error_Sensor_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_X_Axis_Move_To_LP_Timeout_Error_Solution]
kr=LP 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the LP position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_X_Axis_Move_To_Wait_Timeout_Error_Solution]
kr=Wait 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the Wait position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_X_Axis_Move_To_OP_Timeout_Error_Solution]
kr=OP 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the OP position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_Z_Axis_Move_To_Up_Timeout_Error_Solution]
kr=UP 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the UP position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_Z_Axis_Move_To_Down_Timeout_Error_Solution]
kr=Down 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the Down position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_T_Axis_Move_To_0Deg_Timeout_Error_Solution]
kr=0도 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the 0 degree position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_T_Axis_Move_To_180Deg_Timeout_Error_Solution]
kr=180도 위치로 티칭 이동 시 Software에서 설정한 시간 이상 감지 시 발생합니다. 설정 시간 및 위치를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when it detects more than the time set in the software when moving teaching to the 180 degree position. Check the setting time and location. (Change the value on the settings page)

[PortAlarm_OHT_Detect_Error_Solution]
kr=PIO Ready Flag가 꺼진 상태로 OHT Hoist Sensor가 시간 이상 감지되는 경우 발생합니다. 설정 시간 및 센서 상태를 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when the OHT Hoist Sensor is detected for more than a certain amount of time with the PIO Ready Flag turned off. Check the setting time and sensor status. (Change the value on the settings page)

[PortAlarm_Fork_Detect_Error_Solution]
kr=PIO Ready Flag가 꺼진 상태로 STK Fork Sensor가 시간 이상 감지되는 경우 발생합니다. 설정 시간 및 센서 상태를 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when the OHT Hoist Sensor is detected for more than a certain amount of time with the PIO Ready Flag turned off. Check the setting time and sensor status. (Change the value on the settings page)

[PortAlarm_OP_Placement_Detect_Error_Solution]
kr=Auto 공정 중 OP 버퍼에 자재가 있거나 없어야 하는 Step에서 발생합니다. 스텝 번호 및 출, 입 방향, OP 자재 감지 관련 센서 상태를 확인하세요. (관련 센서: Detect1, Detect2, Precense, CV In, CV out)
us=Occurs in the step where there is or should not be a material in the OP buffer during the auto process. Check the sensor status related to step number, exit/input direction, and OP material detection. (Related sensors: Detect1, Detect2, Precense, CV In, CV out)

[PortAlarm_Shuttle_Placement_Detect_Error_Solution]
kr=Auto 공정 중 셔틀에 자재가 있거나 없어야 하는 Step에서 발생합니다. 스텝 번호 및 출, 입 방향, 셔틀 자재 감지 관련 센서 상태를 확인하세요. (관련 센서: Detect1, Detect2)
us=During the Auto process, it occurs in the step where there is or should not be material in the shuttle. Check the step number and sensor status related to exit, entry, and shuttle material detection. (Related sensors: Detect1, Detect2)

[PortAlarm_LP_Placement_Detect_Error_Solution]
kr=Auto 공정 중 LP 버퍼에 자재가 있거나 없어야 하는 Step에서 발생합니다. 스텝 번호 및 출, 입 방향, LP 자재 감지 관련 센서 상태를 확인하세요. (관련 센서: Detect1, Detect2, Precense, CV In, CV out)
us=Occurs in the step where there is or should not be a material in the LP buffer during the auto process. Check the sensor status related to step number, exit/input direction, and LP material detection. (Related sensors: Detect1, Detect2, Precense, CV In, CV out)

[PortAlarm_Port_Area_Sensor_Error_Solution]
kr=Light Curtain이 켜져있는 경우 또는 켜져있는 상태에서 셔틀이 동작 중인 경우 감지 시간 이상으로 측정 시 발생합니다. Light 커튼의 센서 상태 확인 및 설정 시간을 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when measuring beyond the detection time when the light curtain is turned on or when the shuttle is operating while it is turned on. Check the sensor status of the light curtain and check the setting time. (Change the value on the settings page)

[PortAlarm_X_Axis_Crash_Detect_Error_Solution]
kr=셔틀에 자재가 있으며 자재가 있는 버퍼 방향으로 이동 시 발생합니다. 자재 상태 및 진행 방향 및 위치를 확인하세요.
us=Occurs when there is material in the shuttle and it moves in the direction of the buffer where the material is located. Check material condition and progress direction and location.

[PortAlarm_Z_Axis_Crash_Detect_Error_Solution]
kr=셔틀에 자재가 있으며 X축의 위치가 OP 또는 LP 위치가 아닌 곳에서 Z축을 하강하려는 경우 발생합니다. 
us=Occurs when there is material in the shuttle and the position of the X-axis is about to descend on the Z-axis where the position is neither OP nor LP.

[PortAlarm_T_Axis_Crash_Detect_Error_Solution]
kr=Wait 위치가 아닌 상태에서 Turn 동작을 시도하거나 Up 위치가 아닌 상태에서 셔틀에 자재가 있을 때 Turn 동작을 시도하면 발생합니다.  
us=Occurs when Turn operation is attempted in a state other than Wait position or Turn operation is attempted when there is material in the shuttle in a state other than Up position.

[PortAlarm_OP_No_Cassette_ID_Error_Solution]
kr=Auto 공정 시 OP 위치에 자재가 있으나 ID가 없는 경우 발생합니다. (CST를 Input 포트로 재 투입 하거나 Carrier ID 설정 페이지에서 ID를 수동으로 부여 후 진행하세요)
us=Occurs when there is a material in the OP location during the Auto process, but there is no ID. (Reinsert CST into the input port or manually assign an ID on the Carrier ID setting page before proceeding)

[PortAlarm_LP_No_Cassette_ID_Error_Solution]
kr=Auto 공정 시 LP 위치에 자재가 있으나 ID가 없는 경우 발생합니다. (CST를 Input 포트로 재 투입 하거나 Carrier ID 설정 페이지에서 ID를 수동으로 부여 후 진행하세요)
us=Occurs when there is a material in the LP location during the Auto process, but there is no ID. (Reinsert CST into the input port or manually assign an ID on the Carrier ID setting page before proceeding)

[PortAlarm_Shuttle_No_Cassette_ID_Error_Solution]
kr=Auto 공정 시 셔틀에 자재가 있으나 ID가 없는 경우 발생합니다. (CST를 Input 포트로 재 투입 하거나 Carrier ID 설정 페이지에서 ID를 수동으로 부여 후 진행하세요)
us=Occurs when there is material in the shuttle during the Auto process, but there is no ID. (Reinsert CST into the input port or manually assign an ID on the Carrier ID setting page before proceeding)

[PortAlarm_CIM_IF_TimeOut_RF_Read_Req_Error_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_CIM_IF_TimeOut_ID_Remove_Error_Solution]
kr=미사용.
us=Reserve.

[PortAlarm_RM_PIO_IF_TimeOut_Error_Solution]
kr=Auto 공정 시 Stocker와 PIO중 설정 시간 이상으로 측정 시 발생합니다. STK의 TCP/IP 연결 상태 및 설정 시간을 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when measuring more than the set time among Stocker and PIO during Auto process. Check STK TCP/IP connection status and setup time. (Change the value on the settings page)

[PortAlarm_Port_PIO_IF_TimeOut_Error_Solution]
kr=Auto 공정 시 OHT or AGV or OMRON PLC와 PIO중 설정 시간 이상으로 측정 시 발생합니다. 센서 상태 또는 OMRON PLC의 경우 TCP/IP 연결 상태 및 설정 시간을 확인하세요. (설정 페이지에서 값 변경)
us=It occurs when measuring more than the set time among OHT or AGV or OMRON PLC and PIO during Auto process. Check the sensor status or, in the case of OMRON PLC, the TCP/IP connection status and setup time. (Change the value on the settings page)

[PortAlarm_Step_TimeOver_Error_Solution]
kr=Auto 또는 Cycle 공정 시 Step이 설정 시간 이상동안 변하지 않으면 발생합니다. Step 번호 확인 및 센서 및 장비 상태를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when the step does not change for more than the set time during Auto or Cycle process. Check the Step number and check the status of sensors and equipment. (Change the value on the settings page)

[PortAlarm_Conveyor_Moving_TimeOut_Error_Solution]
kr=컨베이어가 설정 시간 이상동안 계속 회전하는 경우 발생합니다. 자재 위치 및 센서 상태를 확인하세요. (설정 페이지에서 값 변경)
us=Occurs when the conveyor continues to rotate for more than the set time. Check material position and sensor status. (Change the value on the settings page)

[PortAlarm_Tag_Read_Fail_Solution]
kr=Auto 또는 Cycle 공정 중 CST ID Read가 5회 이상 실패 시 발생합니다. Reader기의 배선 및 Tag 위치, 상태를 점검하세요 (설정 페이지에서 수동 조작 테스트 가능)
us=Occurs when CST ID Read fails more than 5 times during Auto or Cycle process. Check the reader wiring, tag location, and condition (manual operation test available on the setting page)

[PortAlarm_Tag_Disconnection_Solution]
kr=Auto 또는 Cycle 공정 중 CST ID Read Step에서 Reader의 TCP/IP 상태가 끊어져 있는 경우 발생합니다. 기기 상태 및 Server IP, Server Port 설정을 점검하세요. (메인 화면의 네트워크 설정에서 변경 가능)
us=Occurs when Reader TCP/IP status is disconnected in CST ID Read Step during Auto or Cycle process. Check the device status and Server IP, Server Port settings. (can be changed in the network settings of the main screen)

[PortAlarm_Buffer_LP_CV_Error_Solution]
kr=LP 컨베이어의 Error bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when the error bit of the LP conveyor is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_OP_CV_Error_Solution]
kr=OP 컨베이어의 Error bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when the error bit of the OP conveyor is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_LP_Z_Error_Solution]
kr=컨베이어 타입 포트인 경우 LP Z축의 Error bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the error bit of the LP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_OP_Z_Error_Solution]
kr=컨베이어 타입 포트인 경우 OP Z축의 Error bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the error bit of the OP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_LP_Z_POT_Solution]
kr=컨베이어 타입 포트인 경우 LP Z축의 POT bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the POT bit of the LP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_LP_Z_NOT_Solution]
kr=컨베이어 타입 포트인 경우 LP Z축의 NOT bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the NOT bit of the LP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_OP_Z_POT_Solution]
kr=컨베이어 타입 포트인 경우 OP Z축의 POT bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the POT bit of the OP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)

[PortAlarm_Buffer_OP_Z_NOT_Solution]
kr=컨베이어 타입 포트인 경우 OP Z축의 NOT bit 활성화 시 발생합니다. 비트 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=In the case of a conveyor type port, it occurs when the NOT bit of the OP Z-axis is activated. Check the bit status. (check the WMX IO area on the settings page)



//Master Alarm Solution
[MasterAlarm_HP_Door_E_Stop_Solution]
kr=HP Door 위치에 있는 E Stop Switch의 눌림 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the E Stop Switch located at the HP Door or the IO Mapping state. (check the WMX IO area on the settings page)

[MasterAlarm_OP_Door_E_Stop_Solution]
kr=OP Door 위치에 있는 E Stop Switch의 눌림 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the E Stop Switch located at the OP Door or the IO Mapping state. (check the WMX IO area on the settings page)

[MasterAlarm_HP_STK_Key_Stop_Solution]
kr=Stocker Auto 상태에서 HP의 Auto Key Switch가 Manual 상태로 변경되는 경우 발생합니다. Key Switch 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when HP Auto Key Switch is changed from Stocker Auto to Manual. Check the Key Switch status or IO Mapping status. (check the WMX IO area on the settings page)

[MasterAlarm_OP_STK_Key_Stop_Solution]
kr=Stocker Auto 상태에서 OP의 Auto Key Switch가 Manual 상태로 변경되는 경우 발생합니다. Key Switch 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when OP Auto Key Switch is changed from Stocker Auto to Manual. Check the Key Switch status or IO Mapping status. (check the WMX IO area on the settings page)

[MasterAlarm_HP_Door_Open_Solution]
kr=Stocker Auto 상태 또는 Port Auto 상태에서 HP Door가 Open되는 경우 발생합니다. HP Door 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when the HP Door is opened in Stocker Auto or Port Auto. Check HP Door status or IO Mapping status. (check the WMX IO area on the settings page)

[MasterAlarm_OP_Door_Open_Solution]
kr=Stocker Auto 상태 또는 Port Auto 상태에서 OP Door가 Open되는 경우 발생합니다. OP Door 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when the OP Door is opened in Stocker Auto or Port Auto. Check OP Door status or IO Mapping status. (check the WMX IO area on the settings page)

[MasterAlarm_MC_On_Time_Out_Solution]
kr=미사용.
us=Reserve.

[MasterAlarm_Master_Mode_Change_Error_Solution]
kr=미사용.
us=Reserve.

[MasterAlarm_Maint_Door_Open_Solution]
kr=Stocker Auto 상태 또는 Port Auto 상태에서 Maint Door가 Open되는 경우 발생합니다. Maint Door 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Occurs when the Maint Door is opened in Stocker Auto or Port Auto. Check Maint Door status or IO Mapping status. (check the WMX IO area on the settings page)

[MasterAlarm_CIM_E_Stop_Solution]
kr=CIM에서 E Stop 명령 전송 시 발생합니다.
us=Occurs when CIM sends E Stop command.

[MasterAlarm_Port_Handy_Touch_E_Stop_Solution]
kr=GOT(Handy Touch) E Stop Switch의 눌림 상태 또는 IO Mapping(DTP EMO Status, DTP Mode2) 상태를 확인하세요. (포트 영역 Handy Touch 커넥터)
us=Check the pressed state of the GOT (Handy Touch) E Stop Switch or the IO Mapping (DTP EMO Status, DTP Mode2) state. (port area Handy Touch connector)

[MasterAlarm_HP_Handy_Touch_E_Stop_Solution]
kr=GOT(Handy Touch) E Stop Switch의 눌림 상태 또는 IO Mapping(DTP EMO Status, DTP Mode2) 상태를 확인하세요. (HP 영역 Handy Touch 커넥터)
us=Check the pressed state of the GOT (Handy Touch) E Stop Switch or the IO Mapping (DTP EMO Status, DTP Mode2) state. (HP area Handy Touch connector)

[MasterAlarm_OP_Handy_Touch_E_Stop_Solution]
kr=GOT(Handy Touch) E Stop Switch의 눌림 상태 또는 IO Mapping(DTP EMO Status, DTP Mode2) 상태를 확인하세요. (OP 영역 Handy Touch 커넥터)
us=Check the pressed state of the GOT (Handy Touch) E Stop Switch or the IO Mapping (DTP EMO Status, DTP Mode2) state. (OP area Handy Touch connector)

[MasterAlarm_STK_HP_Handy_Touch_E_Stop_Solution]
kr=Stocker의 HP Handy Touch E Stop Switch의 눌림 상태를 확인하세요.
us=Check the pressed state of Stocker HP Handy Touch E Stop Switch.

[MasterAlarm_STK_OP_Handy_Touch_E_Stop_Solution]
kr=Stocker의 OP Handy Touch E Stop Switch의 눌림 상태를 확인하세요.
us=Check the pressed state of Stocker OP Handy Touch E Stop Switch.

[MasterAlarm_RM_Watch_Dog_Time_Out_Solution]
kr=Stocker에서 10초 이상 통신 데이터를 받지 못하는 경우 발생합니다. TCP/IP 연결 상태 및 Stocker PC 상태를 확인하세요.
us=Occurs when Stocker does not receive communication data for more than 10 seconds. Check the TCP/IP connection status and Stocker PC status.

[MasterAlarm_CIM_Watch_Dog_Time_Over_Solution]
kr=미사용.
us=Reserve.

[MasterAlarm_RM_TCP_Disconnection_Solution]
kr=Stocker와의 TCP/IP 연결 해제시 발생합니다. Stocker PC 상태 또는 IP, Port 설정 값을 점검하세요. (메인 화면의 네트워크 설정에서 변경 가능)
us=Occurs when TCP/IP connection with Stocker is disconnected. Check Stocker PC status or IP, Port settings. (can be changed in the network settings of the main screen)

[MasterAlarm_EtherCAT_Communication_Error_Solution]
kr=WMX Engine이 Communication 상태가 아닐 때 발생합니다. 엔진에 정상 동작 중인경우 Error Reset시 Communication을 다시 시도합니다.
us=Occurs when WMX Engine is not in Communication state. If the engine is operating normally, communication is retried upon error reset.

[MasterAlarm_Slave_Not_Op_State_Error_Solution]
kr=WMX Communication 중 OP 상태가 아닌 Slave가 있으면 발생합니다. 발생 Slave에 대해 케이블, 통신 상태를 확인하세요. (WMX의 Slave 진단 툴을 이용해 확인 가능)
us=Occurs when there is a Slave that is not in OP status during WMX Communication. Check the cable and communication status of the generating slave. (Can be checked using WMX Slave diagnostic tool)

[MasterAlarm_WMX_Engine_Stop_Error_Solution]
kr=WMX Engine이 정지 상태인 경우 발생합니다. WMX Hardware License Dongle 또는 RTX Subsystem Running 상태를 확인하세요.
us=Occurs when the WMX Engine is stopped. Check the WMX Hardware License Dongle or RTX Subsystem Running status.

[MasterAlarm_CPS_Run_Error_Solution]
kr=CPS 사용 설정 후 CPS Run bit가 Off되는 경우 발생합니다. CPS 및 IO Mapping(CPS Run bit) 상태를 확인하세요.
us=Occurs when CPS Run bit is Off after CPS usage is enabled. Check the status of CPS and IO Mapping (CPS Run bit).

[MasterAlarm_RM_Regulator_Fault_Solution]
kr=Stocker의 Regulator Fault 상태를 확인하세요.
us=Check Stocker Regulator Fault status.

[MasterAlarm_HP_Escape_E_Stop_Solution]
kr=내부 HP 영역에 위치한 비상 탈출 Switch의 눌림 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the emergency escape switch located in the internal HP area or the IO Mapping state. (check the WMX IO area on the settings page)

[MasterAlarm_OP_Escape_E_Stop_Solution]
kr=내부 OP 영역에 위치한 비상 탈출 Switch의 눌림 상태 또는 IO Mapping 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the emergency escape switch located in the internal OP area or the IO Mapping state. (check the WMX IO area on the settings page)

[MasterAlarm_Inner_EMO_1_Solution]
kr=Inner_EMO_1에 Mapping된 Switch의 눌림 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the switch mapped to Inner_EMO_1. (check the WMX IO area on the settings page)

[MasterAlarm_Inner_EMO_2_Solution]
kr=Inner_EMO_2에 Mapping된 Switch의 눌림 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the switch mapped to Inner_EMO_2. (check the WMX IO area on the settings page)

[MasterAlarm_Inner_EMO_3_Solution]
kr=Inner_EMO_3에 Mapping된 Switch의 눌림 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the switch mapped to Inner_EMO_3. (check the WMX IO area on the settings page)

[MasterAlarm_Inner_EMO_4_Solution]
kr=Inner_EMO_4에 Mapping된 Switch의 눌림 상태를 확인하세요. (설정 페이지에서 WMX IO 영역 확인)
us=Check the pressed state of the switch mapped to Inner_EMO_4. (check the WMX IO area on the settings page)




